Repository: vertopolkaLF/silence
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ru_ru

# MainWindow.PaneToggleButton.ToolTipService.ToolTip
source: Toggle menu
ru_ru: Переключить меню

# MainWindow.GeneralNavItem.Content
source: General
ru_ru: Общие

# MainWindow.HoldToMuteNavItem.Content
source: Hold to Mute
ru_ru: Удержание

# MainWindow.SoundsNavItem.Content
source: Sounds
ru_ru: Звуки

# MainWindow.OverlayNavItem.Content
source: Overlay
ru_ru: Оверлей

# MainWindow.AppearanceNavItem.Content
source: Tray Icon
ru_ru: Значок в трее

# MainWindow.AboutNavItem.Content
source: About
ru_ru: О приложении

# MainWindow.UpdateAvailableText.Text
source: Update Available
ru_ru: Есть обновление

# MainWindow.UpdateDetailsButton.Content
source: View Details
ru_ru: Подробнее

# MainWindow.UpdateNotificationCompact.ToolTipService.ToolTip
source: Update Available
ru_ru: Есть обновление

# Tray.Menu.ShowSettings
source: Show Settings
ru_ru: Открыть настройки

# Tray.Menu.ToggleMute
source: Toggle Mute
ru_ru: Переключить микрофон

# Tray.Menu.RefreshOverlay
source: Refresh Overlay
ru_ru: Обновить оверлей

# Tray.Menu.Exit
source: Exit
ru_ru: Выход

# Tray.Tooltip.Muted
source: silence! - Microphone MUTED
ru_ru: silence! - микрофон выключен

# Tray.Tooltip.Unmuted
source: silence! - Microphone ON
ru_ru: silence! - микрофон включен

# AboutPage.DescriptionText.Text
source: A simple microphone mute/unmute utility with global hotkey support.
ru_ru: Простая утилита для выключения и включения микрофона с глобальной горячей клавишей.

# AboutPage.LanguageTitle.Text
source: Language
ru_ru: Язык

# AboutPage.LanguageSystemItem.Content
source: System default
ru_ru: По умолчанию в системе

# AboutPage.LanguageEnglishItem.Content
source: English
ru_ru: Английский

# AboutPage.LanguageRussianItem.Content
source: Russian
ru_ru: Русский

# AboutPage.UpdatesHeaderText.Text
source: Updates
ru_ru: Обновления

# AboutPage.CheckingText.Text
source: Checking for updates...
ru_ru: Проверка обновлений...

# AboutPage.UpToDateText.Text
source: You're up to date!
ru_ru: У вас последняя версия!

# AboutPage.UpdateAvailableText.Text
source: Update available!
ru_ru: Доступно обновление!

# AboutPage.NewVersionText.Text
source: New version: v1.1.0
ru_ru: Новая версия: v1.1.0

# AboutPage.DownloadUpdateButton.Content
source: Download & Install
ru_ru: Скачать и установить

# AboutPage.ViewReleaseButton.Content
source: View Release
ru_ru: Открыть релиз

# AboutPage.DownloadingText.Text
source: Downloading update...
ru_ru: Скачивание обновления...

# AboutPage.ErrorText.Text
source: Failed to check for updates
ru_ru: Не удалось проверить обновления

# AboutPage.CheckUpdatesButton.Content
source: Check for Updates
ru_ru: Проверить обновления

# AboutPage.AutoCheckToggle.Header
source: Check for updates on startup
ru_ru: Проверять обновления при запуске

# AboutPage.ViewOnGitHubButton.Content
source: View on GitHub
ru_ru: Открыть на GitHub

# AboutPage.MadeByText.Text
source: Made with love by vertopolkaLF
ru_ru: Сделано с любовью от vertopolkaLF

# AboutPage.CreditsTitle.Text
source: Credits
ru_ru: Благодарности

# GeneralPage.MicrophoneStatusPrefixText.Text
source: Microphone is
ru_ru: Микрофон

# GeneralPage.MicrophoneLabel.Text
source: Microphone
ru_ru: Микрофон

# GeneralPage.MicrophoneComboBox.PlaceholderText
source: Select microphone...
ru_ru: Выберите микрофон...

# GeneralPage.HotkeysLabel.Text
source: Hotkeys
ru_ru: Горячие клавиши

# GeneralPage.ToggleHotkeyLabel.Text
source: Toggle microphone
ru_ru: Переключить микрофон

# GeneralPage.MuteHotkeyLabel.Text
source: Mute microphone
ru_ru: Выключить микрофон

# GeneralPage.UnmuteHotkeyLabel.Text
source: Unmute microphone
ru_ru: Включить микрофон

# GeneralPage.AddHotkeyButton.Content
source: Add hotkey
ru_ru: Добавить сочетание

# GeneralPage.HotkeyTextBox.PlaceholderText
source: Press a key...
ru_ru: Нажмите клавишу...

# GeneralPage.ClearHotkeyButton.ToolTipService.ToolTip
source: Clear hotkey
ru_ru: Очистить сочетание

# GeneralPage.RemoveHotkeyButton.ToolTipService.ToolTip
source: Remove hotkey
ru_ru: Удалить сочетание

# GeneralPage.RecordHotkeyButton.Content
source: Record
ru_ru: Записать

# GeneralPage.HotkeyHintText.Text
source: To bind LMB, RMB or 2 modifier keys - hold them for 1 second
ru_ru: Чтобы назначить ЛКМ, ПКМ или 2 модификатора, удерживайте их 1 секунду

# GeneralPage.IgnoreModifiersCheckBox.Content
source: Ignore modifiers (Shift, Ctrl, Alt, Win)
ru_ru: Игнорировать модификаторы (Shift, Ctrl, Alt, Win)

# GeneralPage.StartupLabel.Text
source: Startup
ru_ru: Запуск

# GeneralPage.AutoStartCheckBox.Content
source: Start with Windows
ru_ru: Запускать вместе с Windows

# GeneralPage.StartMinimizedCheckBox.Content
source: Start minimized to tray
ru_ru: Запускать свернутым в трей

# HoldToMutePage.TitleText.Text
source: Hold to Mute
ru_ru: Удержание

# HoldToMutePage.DescriptionText.Text
source: Mute/unmute your microphone while holding a hotkey
ru_ru: Выключайте или включайте микрофон, пока удерживаете горячую клавишу

# HoldToMutePage.HotkeyLabel.Text
source: Hotkeys
ru_ru: Горячие клавиши

# HoldToMutePage.HoldHotkeyTextBox.PlaceholderText
source: Not set
ru_ru: Не задано

# HoldToMutePage.ClearHoldHotkeyButton.ToolTipService.ToolTip
source: Clear hotkey
ru_ru: Очистить сочетание

# HoldToMutePage.RecordHoldHotkeyButton.Content
source: Record
ru_ru: Записать

# HoldToMutePage.HoldHotkeyHintText.Text
source: To bind LMB, RMB or modifier keys - hold them for 1 second
ru_ru: Чтобы назначить ЛКМ, ПКМ или модификаторы, удерживайте их 1 секунду

# HoldToMutePage.IgnoreHoldModifiersCheckBox.Content
source: Ignore modifiers (Shift, Ctrl, Alt, Win)
ru_ru: Игнорировать модификаторы (Shift, Ctrl, Alt, Win)

# HoldToMutePage.ActionLabel.Text
source: Action
ru_ru: Действие

# HoldToMutePage.ActionToggleItem.Content
source: Toggle current state
ru_ru: Переключать текущее состояние

# HoldToMutePage.ActionHoldToMuteItem.Content
source: Hold to mute
ru_ru: Выключать при удержании

# HoldToMutePage.ActionHoldToUnmuteItem.Content
source: Hold to unmute
ru_ru: Включать при удержании

# HoldToMutePage.OptionsLabel.Text
source: Options
ru_ru: Параметры

# HoldToMutePage.HoldPlaySoundsCheckBox.Content
source: Play sounds
ru_ru: Воспроизводить звуки

# HoldToMutePage.HoldShowOverlayCheckBox.Content
source: Show overlay
ru_ru: Показывать оверлей

# HoldToMutePage.SoundSettingsTitle.Text
source: Sound Settings
ru_ru: Настройки звука

# HoldToMutePage.SoundSettingsDescription.Text
source: Configure separate sounds for hold-to-mute or use defaults from Sounds tab
ru_ru: Настройте отдельные звуки для удержания или используйте значения из вкладки «Звуки»

# HoldToMutePage.VolumeLabel.Text
source: Volume
ru_ru: Громкость

# HoldToMutePage.ResetHoldVolumeButton.Content
source: Reset
ru_ru: Сбросить

# HoldToMutePage.MuteSoundLabel.Text
source: Mute Sound
ru_ru: Звук выключения

# HoldToMutePage.HoldMuteSoundComboBox.PlaceholderText
source: Default
ru_ru: По умолчанию

# HoldToMutePage.PlayHoldMuteSoundButton.ToolTipService.ToolTip
source: Play sound
ru_ru: Воспроизвести звук

# HoldToMutePage.ResetHoldMuteSoundButton.Content
source: Reset
ru_ru: Сбросить

# HoldToMutePage.UnmuteSoundLabel.Text
source: Unmute Sound
ru_ru: Звук включения

# HoldToMutePage.HoldUnmuteSoundComboBox.PlaceholderText
source: Default
ru_ru: По умолчанию

# HoldToMutePage.PlayHoldUnmuteSoundButton.ToolTipService.ToolTip
source: Play sound
ru_ru: Воспроизвести звук

# HoldToMutePage.ResetHoldUnmuteSoundButton.Content
source: Reset
ru_ru: Сбросить

# SoundsPage.TitleText.Text
source: Sounds
ru_ru: Звуки

# SoundsPage.SoundsEnabledToggle.Header
source: Enable sounds
ru_ru: Включить звуки

# SoundsPage.SoundsEnabledToggle.OffContent
source: Sounds disabled
ru_ru: Звуки отключены

# SoundsPage.SoundsEnabledToggle.OnContent
source: Sounds enabled
ru_ru: Звуки включены

# SoundsPage.VolumeLabel.Text
source: Volume
ru_ru: Громкость

# SoundsPage.MuteSoundLabel.Text
source: Mute Sound
ru_ru: Звук выключения

# SoundsPage.MuteSoundComboBox.PlaceholderText
source: Select sound...
ru_ru: Выберите звук...

# SoundsPage.PlayMuteSoundButton.ToolTipService.ToolTip
source: Play sound
ru_ru: Воспроизвести звук

# SoundsPage.RemoveMuteCustomSoundButton.ToolTipService.ToolTip
source: Remove custom sound
ru_ru: Удалить свой звук

# SoundsPage.UnmuteSoundLabel.Text
source: Unmute Sound
ru_ru: Звук включения

# SoundsPage.UnmuteSoundComboBox.PlaceholderText
source: Select sound...
ru_ru: Выберите звук...

# SoundsPage.PlayUnmuteSoundButton.ToolTipService.ToolTip
source: Play sound
ru_ru: Воспроизвести звук

# SoundsPage.RemoveUnmuteCustomSoundButton.ToolTipService.ToolTip
source: Remove custom sound
ru_ru: Удалить свой звук

# SoundsPage.CustomSoundsTitle.Text
source: Custom Sounds
ru_ru: Свои звуки

# SoundsPage.CustomSoundsDescription.Text
source: Add your own sound files (MP3, WAV, FLAC, OGG, M4A, WMA)
ru_ru: Добавьте свои звуковые файлы (MP3, WAV, FLAC, OGG, M4A, WMA)

# SoundsPage.AddCustomSoundButton.Content
source: Browse for sound file...
ru_ru: Выбрать звуковой файл...

# SoundsPage.CustomListPlayButton.ToolTipService.ToolTip
source: Play
ru_ru: Воспроизвести

# SoundsPage.CustomListDeleteButton.ToolTipService.ToolTip
source: Delete
ru_ru: Удалить

# AppearancePage.TitleText.Text
source: Tray Icon
ru_ru: Значок в трее

# AppearancePage.IconStyleLabel.Text
source: Icon Style
ru_ru: Стиль значка

# AppearancePage.StandardLabel.Text
source: Standard
ru_ru: Стандартный

# AppearancePage.FilledCircleLabel.Text
source: Filled circle
ru_ru: Заполненный круг

# AppearancePage.DotLabel.Text
source: Dot
ru_ru: Точка

# AppearancePage.PreviewDescriptionText.Text
source: Preview uses the current microphone state. Muted is red, unmuted is green.
ru_ru: Превью использует текущее состояние микрофона. Выключенный микрофон красный, включенный зеленый.

# OverlayPage.TitleText.Text
source: Overlay
ru_ru: Оверлей

# OverlayPage.OverlayEnabledToggle.Header
source: Enable overlay
ru_ru: Включить оверлей

# OverlayPage.OverlayEnabledToggle.OffContent
source: Overlay disabled
ru_ru: Оверлей выключен

# OverlayPage.OverlayEnabledToggle.OnContent
source: Overlay enabled
ru_ru: Оверлей включен

# OverlayPage.OverlayEnabledDescriptionText.Text
source: Shows mute status on top of all windows
ru_ru: Показывает состояние микрофона поверх всех окон

# OverlayPage.VisibilityModeLabel.Text
source: Visibility Mode
ru_ru: Режим видимости

# OverlayPage.VisibilityAlwaysItem.Content
source: Always visible
ru_ru: Всегда показывать

# OverlayPage.VisibilityWhenMutedItem.Content
source: Visible when muted
ru_ru: Показывать, когда микрофон выключен

# OverlayPage.VisibilityWhenUnmutedItem.Content
source: Visible when unmuted
ru_ru: Показывать, когда микрофон включен

# OverlayPage.VisibilityAfterToggleItem.Content
source: Show after toggle
ru_ru: Показывать после переключения

# OverlayPage.ScreenLabel.Text
source: Screen
ru_ru: Экран

# OverlayPage.ScreenComboBox.PlaceholderText
source: Select screen...
ru_ru: Выберите экран...

# OverlayPage.ScreenDescriptionText.Text
source: Select which monitor to display the overlay on
ru_ru: Выберите монитор, на котором показывать оверлей

# OverlayPage.OverlayButtonModeLabel.Text
source: Use overlay as mute button
ru_ru: Использовать оверлей как кнопку

# OverlayPage.OverlayButtonModeToggle.Header
source: Use overlay as mute button
ru_ru: Использовать оверлей как кнопку

# OverlayPage.OverlayButtonModeToggle.OffContent
source: Click-through overlay
ru_ru: Оверлей прозрачен для кликов

# OverlayPage.OverlayButtonModeToggle.OnContent
source: Clickable mute toggle
ru_ru: Оверлей переключает микрофон

# OverlayPage.OverlayButtonModeDescriptionText.Text
source: When enabled, the overlay stops being click-through, toggles the microphone on click, and can always be dragged.
ru_ru: Когда включено, оверлей перестает пропускать клики, переключает микрофон по нажатию и его всегда можно перетаскивать.

# OverlayPage.PositionTitle.Text
source: Overlay Position
ru_ru: Позиция оверлея

# OverlayPage.SetPositionButton.Content
source: Set Position
ru_ru: Задать позицию

# OverlayPage.DonePositionButton.Content
source: Done
ru_ru: Готово

# OverlayPage.PositionDescriptionText.Text
source: Click to show overlay and drag it to desired position. The overlay will snap to center when close to the middle of the screen. Press ESC or click Done to save.
ru_ru: Нажмите, чтобы показать оверлей и перетащить его в нужное место. Оверлей притягивается к центру, если подвести его близко к середине экрана. Нажмите ESC или «Готово», чтобы сохранить.

# OverlayPage.PreviewLabel.Text
source: Preview
ru_ru: Предпросмотр

# OverlayPage.PreviewOverlayButton.Content
source: Preview Overlay
ru_ru: Показать оверлей

# OverlayPage.AppearanceTitle.Text
source: Appearance
ru_ru: Внешний вид

# OverlayPage.OverlayStyleLabel.Text
source: Overlay Style
ru_ru: Стиль оверлея

# OverlayPage.MicIconVariantLabel.Text
source: Mic Icon
ru_ru: Иконка микрофона

# OverlayPage.DotVariantLabel.Text
source: Dot
ru_ru: Точка

# OverlayPage.ShowTextToggle.Header
source: Show text
ru_ru: Показывать текст

# OverlayPage.ShowTextToggle.OffContent
source: Icon only
ru_ru: Только значок

# OverlayPage.ShowTextToggle.OnContent
source: Icon with text
ru_ru: Значок и текст

# OverlayPage.IconStyleLabel.Text
source: Icon style
ru_ru: Стиль значка

# OverlayPage.IconStyleColoredItem.Content
source: Colored (red/green)
ru_ru: Цветной (красный/зеленый)

# OverlayPage.IconStyleMonochromeItem.Content
source: Monochrome
ru_ru: Монохромный

# OverlayPage.BackgroundStyleLabel.Text
source: Background
ru_ru: Фон

# OverlayPage.BackgroundDarkItem.Content
source: Dark
ru_ru: Темный

# OverlayPage.BackgroundLightItem.Content
source: Light
ru_ru: Светлый

# OverlayPage.ShowBorderToggle.Header
source: Overlay border
ru_ru: Граница оверлея

# OverlayPage.ShowBorderToggle.OffContent
source: No border
ru_ru: Без границы

# OverlayPage.ShowBorderToggle.OnContent
source: Show border
ru_ru: Показывать границу

# Common.Default
source: Default
ru_ru: По умолчанию

# Sounds.DefaultFromSoundsTab
source: Default (from Sounds tab)
ru_ru: По умолчанию (из вкладки «Звуки»)

# Sounds.BrowseForFile
source: Browse for file...
ru_ru: Выбрать файл...

# Sounds.CustomItem
source: Custom: {0}
ru_ru: Свой: {0}

# Sounds.CustomSelection
source: Custom: {0}
ru_ru: Свой: {0}

# Sounds.Preloaded.None
source: None
ru_ru: Нет

# Hotkeys.RecordPrompt
source: Press keys...
ru_ru: Нажмите клавиши...

# Hotkeys.Key.MouseLeft
source: Mouse Left
ru_ru: Левая кнопка мыши

# Hotkeys.Key.MouseRight
source: Mouse Right
ru_ru: Правая кнопка мыши

# Hotkeys.Key.MouseMiddle
source: Mouse Middle
ru_ru: Средняя кнопка мыши

# Hotkeys.Key.Mouse4
source: Mouse 4
ru_ru: Кнопка мыши 4

# Hotkeys.Key.Mouse5
source: Mouse 5
ru_ru: Кнопка мыши 5

# Hotkeys.Key.Space
source: Space
ru_ru: Пробел

# Hotkeys.Key.Generic
source: Key {0}
ru_ru: Клавиша {0}

# General.Microphone.Default
source: Default Microphone
ru_ru: Микрофон по умолчанию

# General.Microphone.All
source: All Microphones
ru_ru: Все микрофоны

# General.Microphone.NamedDefault
source: {0} (Default)
ru_ru: {0} (по умолчанию)

# General.MuteStatus.Muted
source: muted
ru_ru: выключен

# General.MuteStatus.Unmuted
source: unmuted
ru_ru: включен

# General.Hotkey.Record
source: Record
ru_ru: Записать

# General.Hotkey.RecordCancel
source: Cancel
ru_ru: Отмена

# HoldToMute.ActionDescription.Toggle
source: Toggle between muted/unmuted while holding
ru_ru: Переключать микрофон, пока клавиша удерживается

# HoldToMute.ActionDescription.HoldToMute
source: Mute while holding (unmute on release)
ru_ru: Выключать при удержании (включать при отпускании)

# HoldToMute.ActionDescription.HoldToUnmute
source: Unmute while holding (mute on release)
ru_ru: Включать при удержании (выключать при отпускании)

# HoldToMute.Hotkey.Record
source: Record
ru_ru: Записать

# HoldToMute.Hotkey.RecordCancel
source: Cancel
ru_ru: Отмена

# Update.NewVersion
source: New version: v{0}
ru_ru: Новая версия: v{0}

# Update.NoInstallerAvailable
source: No installer available
ru_ru: Установщик недоступен

# Update.NoInstallerForPlatform
source: No installer for your platform
ru_ru: Нет установщика для вашей платформы

# Update.DownloadingProgress
source: Downloading... {0:F0}%
ru_ru: Скачивание... {0:F0}%

# Update.StartingInstaller
source: Starting installer...
ru_ru: Запуск установщика...

# Update.Error.Unknown
source: Unknown error
ru_ru: Неизвестная ошибка

# Update.Error.DownloadFailed
source: Download failed
ru_ru: Не удалось скачать обновление

# Update.Error.GitHubApiStatus
source: GitHub API returned {0}
ru_ru: GitHub API вернул {0}

# Update.Error.ParseResponse
source: Failed to parse GitHub response
ru_ru: Не удалось разобрать ответ GitHub

# Update.Error.Network
source: Network error: {0}
ru_ru: Сетевая ошибка: {0}

# Update.Error.Timeout
source: Request timed out
ru_ru: Истекло время ожидания запроса

# Update.Error.Unexpected
source: Unexpected error: {0}
ru_ru: Непредвиденная ошибка: {0}

# Notification.UpdateAvailable.Title
source: Update Available: v{0}
ru_ru: Доступно обновление: v{0}

# Notification.UpdateAvailable.Body
source: A new version of silence! is ready to install
ru_ru: Новая версия silence! готова к установке

# Notification.UpdateAvailable.Install
source: Install Update
ru_ru: Установить обновление

# Notification.UpdateFailed.Title
source: Update Installation Failed
ru_ru: Не удалось установить обновление

# Notification.UpdateFailed.Body
source: Failed to download the update
ru_ru: Не удалось скачать обновление

# Overlay.Status.Muted
source: Microphone is muted
ru_ru: Микрофон выключен

# Overlay.Status.Unmuted
source: Microphone is unmuted
ru_ru: Микрофон включен

# Overlay.Duration
source: Duration: {0:F1}s
ru_ru: Длительность: {0:F1} c

# Overlay.BackgroundOpacity
source: Background opacity: {0}%
ru_ru: Непрозрачность фона: {0}%

# Overlay.ContentOpacity
source: Opacity: {0}%
ru_ru: Непрозрачность: {0}%

# Overlay.BorderRadius
source: Border radius: {0}px
ru_ru: Скругление углов: {0}px

# Overlay.Scale
source: Size scale: {0}%
ru_ru: Размер: {0}%

# Overlay.Screen.Primary
source: Primary Screen
ru_ru: Основной экран

# Overlay.Screen.Named
source: Screen {0}: {1} ({2}x{3})
ru_ru: Экран {0}: {1} ({2}x{3})

# Overlay.Screen.NamedPrimary
source: Screen {0}: {1} ({2}x{3}) - Primary
ru_ru: Экран {0}: {1} ({2}x{3}) - основной

# Overlay.Position.Center
source: Center
ru_ru: Центр

# Overlay.Position.Left
source: Left {0:F0}%
ru_ru: Слева {0:F0}%

# Overlay.Position.Right
source: Right {0:F0}%
ru_ru: Справа {0:F0}%

# Overlay.Position.Middle
source: Middle
ru_ru: Середина

# Overlay.Position.Top
source: Top {0:F0}%
ru_ru: Сверху {0:F0}%

# Overlay.Position.Bottom
source: Bottom {0:F0}%
ru_ru: Снизу {0:F0}%

# Overlay.Position.Current
source: Current: {0}, {1}
ru_ru: Текущее положение: {0}, {1}
